open-vela/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_voice_service.c
/****************************************************************************
 * app/bk7258/bk7258_voice_service.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * AP-resident authorized-voice service.  RPMsg receive callbacks only copy
 * and validate requests; file I/O and audio streaming run in a worker task.
 ****************************************************************************/

#include <nuttx/config.h>

#ifdef CONFIG_BK7258_VOICE_SERVICE

#include "bk7258_product_lifecycle.h"
#include "bk7258_voice_pack.h"
#include "bk7258_voice_product.h"
#include "bk7258_voice_protocol.h"
#ifdef CONFIG_BK7258_PREFERENCES
#  include "bk7258_preferences.h"
#endif
#include "bk7258_voice_ptt.h"
#include "bk7258_voice_turn_audio.h"
#ifdef CONFIG_BK7258_VOICE_TLS
#  include "bk7258_voice_runtime.h"
#endif
#ifdef CONFIG_BK7258_DISPLAY_SERVICE
#  include "bk7258_voice_feedback.h"
#endif

#include <errno.h>
#include <fcntl.h>
#include <media_player.h>
#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <sys/stat.h>
#include <syslog.h>
#include <unistd.h>

#include <arch/chip/bk7258_amp.h>
#include <nuttx/irq.h>
#include <nuttx/mutex.h>
#include <nuttx/rpmsg/rpmsg.h>
#include <nuttx/semaphore.h>
#include <nuttx/spinlock.h>
#include <nuttx/clock.h>

#define BKVOICE_STREAM_BYTES 2048u
#define BKVOICE_PLAYER_OPTIONS \
  "format=s16le:sample_rate=16000:ch_layout=mono"
#ifdef CONFIG_BK7258_VOICE_TLS
#  define BKVOICE_TRANSPORT_STATUS "tls-wss"
#else
#  define BKVOICE_TRANSPORT_STATUS "not-installed"
#endif
struct bkvoice_service_s
{
  struct rpmsg_endpoint endpoint;
  mutex_t init_lock;
  mutex_t endpoint_lock;
  spinlock_t request_lock;
  sem_t request_sem;
  volatile bool initialized;
  volatile bool endpoint_created;
  volatile uint32_t endpoint_generation;
  bool active;
  bool replay_valid;
  uint32_t active_generation;
  struct bkvoice_rpc_request_s active_request;
  struct bkvoice_rpc_request_s last_request;
  struct bkvoice_rpc_response_s last_response;
  struct bkvoice_turn_audio_s turn_audio;
  struct bkvoice_ptt_s ptt;
};

static struct bkvoice_service_s g_bkvoice_service =
{
  .init_lock = NXMUTEX_INITIALIZER,
  .endpoint_lock = NXMUTEX_INITIALIZER,
  .request_lock = SP_UNLOCKED,
};

extern void bk7258_agent_media_player_link(void);
extern void bk7258_agent_media_recorder_link(void);

static int bkvoice_errno(void)
{
  return errno > 0 ? -errno : -EIO;
}

static void bkvoice_advance_generation(struct bkvoice_service_s *service)
{
  uint32_t generation = __atomic_add_fetch(&service->endpoint_generation,
                                           1u, __ATOMIC_ACQ_REL);

  if (generation == 0)
    {
      generation = 1;
    }

  __atomic_store_n(&service->endpoint_generation, generation,
                   __ATOMIC_RELEASE);
}

static void bkvoice_first_error(int *first, int ret)
{
  if (*first == 0 && ret < 0)
    {
      *first = ret;
    }
}

static int bkvoice_read_exact(int fd, void *buffer, size_t size)
{
  uint8_t *cursor = buffer;
  size_t done = 0;

  while (done < size)
    {
      ssize_t nread = read(fd, cursor + done, size - done);

      if (nread < 0)
        {
          if (errno == EINTR)
            {
              continue;
            }

          return bkvoice_errno();
        }

      if (nread == 0)
        {
          return -ENODATA;
        }

      done += (size_t)nread;
    }

  return OK;
}

static int bkvoice_write_player(void *player, const uint8_t *buffer,
                                size_t size)
{
  size_t written = 0;

  while (written < size)
    {
      ssize_t ret = media_player_write_data(player, buffer + written,
                                            size - written);

      if (ret < 0)
        {
          return (int)ret;
        }

      if (ret == 0)
        {
          return -EIO;
        }

      written += (size_t)ret;
    }

  return OK;
}

static bool bkvoice_connection_valid(struct bkvoice_service_s *service,
                                     uint32_t generation)
{
  return __atomic_load_n(&service->endpoint_created, __ATOMIC_ACQUIRE) &&
         __atomic_load_n(&service->endpoint_generation, __ATOMIC_ACQUIRE) ==
         generation;
}

static int bkvoice_play_wav(struct bkvoice_service_s *service,
                            uint32_t generation, const char *path,
                            struct bkvoice_wav_info_s *wav)
{
  uint8_t *buffer = NULL;
  uint32_t remaining;
  void *player = NULL;
  bool prepared = false;
#ifdef CONFIG_BK7258_DISPLAY_SERVICE
  bool feedback_active = false;
#endif
  int fd = -1;
  int first = 0;
  int ret;

  fd = open(path, O_RDONLY | O_CLOEXEC);
  if (fd < 0)
    {
      return bkvoice_errno();
    }

  ret = bkvoice_wav_parse(fd, wav);
  if (ret < 0)
    {
      first = ret;
      goto out;
    }

  buffer = malloc(BKVOICE_STREAM_BYTES);
  if (buffer == NULL)
    {
      first = -ENOMEM;
      goto out;
    }

  player = media_player_open(MEDIA_STREAM_MUSIC);
  if (player == NULL)
    {
      first = bkvoice_errno();
      goto out;
    }

  ret = media_player_prepare(player, NULL, BKVOICE_PLAYER_OPTIONS);
  if (ret < 0)
    {
      first = ret;
      goto out;
    }

  prepared = true;
  ret = media_player_start(player);
  if (ret < 0)
    {
      first = ret;
      goto out;
    }

#ifdef CONFIG_BK7258_DISPLAY_SERVICE
  bk7258_voice_feedback_report(NULL, BKVOICE_TURN_PLAYING);
  feedback_active = true;
#endif

  remaining = wav->data_bytes;
  while (remaining > 0)
    {
      size_t chunk = remaining < BKVOICE_STREAM_BYTES ?
                     remaining : BKVOICE_STREAM_BYTES;

      if (!bkvoice_connection_valid(service, generation))
        {
          first = -ECANCELED;
          break;
        }

      ret = bkvoice_read_exact(fd, buffer, chunk);
      if (ret < 0)
        {
          first = ret;
          break;
        }

      ret = bkvoice_write_player(player, buffer, chunk);
      if (ret < 0)
        {
          first = ret;
          break;
        }

      remaining -= (uint32_t)chunk;
    }

out:
  if (player != NULL && prepared)
    {
      ret = media_player_stop(player);
      bkvoice_first_error(&first, ret);
    }

