open-vela/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_voice_service.c
  if (player != NULL)
    {
      ret = media_player_close(player, 0);
      bkvoice_first_error(&first, ret);
    }

  free(buffer);
  if (fd >= 0 && close(fd) < 0)
    {
      bkvoice_first_error(&first, bkvoice_errno());
    }

#ifdef CONFIG_BK7258_DISPLAY_SERVICE
  if (feedback_active)
    {
      bk7258_voice_feedback_report(NULL, BKVOICE_TURN_IDLE);
    }
#endif

  return first;
}

static void bkvoice_make_response(
  struct bkvoice_rpc_response_s *response,
  const struct bkvoice_rpc_request_s *request, int status)
{
  memset(response, 0, sizeof(*response));
  response->magic = BKVOICE_RPC_MAGIC;
  response->version = BKVOICE_RPC_VERSION;
  response->command = BKVOICE_RPC_RESPONSE;
  response->session = request->session;
  response->sequence = request->sequence;
  response->status = status;
}

static int bkvoice_send(struct bkvoice_service_s *service,
                        const struct bkvoice_rpc_response_s *response)
{
  int ret = nxmutex_lock(&service->endpoint_lock);

  if (ret < 0)
    {
      return ret;
    }

  if (!__atomic_load_n(&service->endpoint_created, __ATOMIC_ACQUIRE) ||
      !is_rpmsg_ept_ready(&service->endpoint))
    {
      ret = -ENOTCONN;
    }
  else
    {
      ret = rpmsg_trysend(&service->endpoint, response,
                          sizeof(*response));
    }

  nxmutex_unlock(&service->endpoint_lock);
  return ret;
}

#ifdef CONFIG_BK7258_PREFERENCES
static int bkvoice_preferences_request(
  const struct bkvoice_rpc_request_s *request,
  struct bkvoice_rpc_response_s *response)
{
  struct bk7258_preferences_s preferences;
  unsigned int volume = 0;
  const char *value = request->manifest;
  int ret = OK;

  if (request->command == BKVOICE_RPC_PREFS_VOLUME)
    {
      /* Validate again at the AP boundary; the CP shell is not the owner. */

      if (*value == '\0' || strlen(value) > 3)
        {
          return -EINVAL;
        }

      for (; *value != '\0'; value++)
        {
          if (*value < '0' || *value > '9')
            {
              return -EINVAL;
            }

          volume = volume * 10u + (unsigned int)(*value - '0');
        }

      ret = bk7258_preferences_set_volume(volume);
    }
  else if (request->command == BKVOICE_RPC_PREFS_PERSONA)
    {
      ret = bk7258_preferences_set_persona(value);
    }

  if (ret < 0)
    {
      return ret;
    }

  ret = bk7258_preferences_get(&preferences);
  if (ret < 0)
    {
      return ret;
    }

  response->result.preferences.volume_percent = preferences.volume_percent;
  response->result.preferences.persona = preferences.persona;
  response->result.preferences.default_flags =
    (preferences.volume_is_default ? BKVOICE_PREFS_DEFAULT_VOLUME : 0) |
    (preferences.persona_is_default ? BKVOICE_PREFS_DEFAULT_PERSONA : 0);
  return OK;
}
#endif

static int bkvoice_handle_request(
  struct bkvoice_service_s *service, uint32_t generation,
  const struct bkvoice_rpc_request_s *request,
  struct bkvoice_rpc_response_s *response)
{
  struct bkvoice_pack_info_s pack;
  struct bkvoice_wav_info_s wav;
  struct stat status;
  int ret = OK;

  bkvoice_make_response(response, request, OK);
  response->flags = BKVOICE_STATUS_SERVICE_READY |
                    BKVOICE_STATUS_LOCAL_ONLY |
                    BKVOICE_STATUS_PTT_OWNER_READY;
  if (stat("/dev/mmcsd0", &status) == 0)
    {
      response->flags |= BKVOICE_STATUS_BLOCK_PRESENT;
    }

  if (request->command == BKVOICE_RPC_STATUS)
    {
#ifdef CONFIG_BK7258_VOICE_TLS
      bkvoice_runtime_status(response);
#endif
      return OK;
    }

#ifdef CONFIG_BK7258_VOICE_HIL_TEST
  if (request->command == BKVOICE_RPC_HIL_CAPTURE)
    {
      response->status = bkvoice_runtime_command(request, response);
      return response->status;
    }
#endif

  if (request->command >= BKVOICE_RPC_CONFIG_BEGIN &&
      request->command <= BKVOICE_RPC_DISCONNECT)
    {
#ifdef CONFIG_BK7258_VOICE_TLS
      response->status = bkvoice_runtime_command(request, response);
#else
      response->status = -ENOSYS;
#endif
      return response->status;
    }

#ifdef CONFIG_BK7258_VOICE_TLS
  if ((request->command >= BKVOICE_RPC_PREFS_GET &&
       request->command <= BKVOICE_RPC_PREFS_PERSONA) ?
      bkvoice_runtime_settings_busy() : bkvoice_runtime_busy())
    {
      response->status = -EBUSY;
      return response->status;
    }
#endif

  if (request->command >= BKVOICE_RPC_PREFS_GET &&
      request->command <= BKVOICE_RPC_PREFS_PERSONA)
    {
#ifdef CONFIG_BK7258_PREFERENCES
      response->status = bkvoice_preferences_request(request, response);
#else
      response->status = -ENOSYS;
#endif
      return response->status;
    }

  memset(&pack, 0, sizeof(pack));
  ret = bkvoice_pack_load(request->manifest,
                          request->command == BKVOICE_RPC_PLAY ?
                          request->clip_id : NULL,
                          &pack);
  response->result.pack.version = pack.version;
  response->result.pack.clip_count = pack.clip_count;
  response->result.pack.error_line = pack.error_line;
  memcpy(response->speaker_id, pack.speaker_id,
         sizeof(response->speaker_id));
  response->speaker_id[sizeof(response->speaker_id) - 1u] = '\0';
  if (ret < 0 || request->command == BKVOICE_RPC_VERIFY)
    {
      response->status = ret;
      return ret;
    }

  syslog(LOG_NOTICE,
         "BKVOICE SYNTHETIC speaker_id=%s clip=%s\n",
         pack.speaker_id, request->clip_id);
  memset(&wav, 0, sizeof(wav));
  ret = bkvoice_play_wav(service, generation, pack.clip_path, &wav);
  response->status = ret;
  response->data_bytes = wav.data_bytes;
  if (ret >= 0)
    {
      response->duration_ms =
        (uint32_t)((uint64_t)wav.data_bytes * 1000u /
                   (BKVOICE_SAMPLE_RATE *
                    (BKVOICE_BITS_PER_SAMPLE / 8u)));
    }

  return ret;
}

static int bkvoice_worker(int argc, char **argv)
{
  struct bkvoice_service_s *service = &g_bkvoice_service;

  (void)argc;
  (void)argv;

  for (; ; )
    {
      struct bkvoice_rpc_request_s request;
      struct bkvoice_rpc_response_s response;
      uint32_t generation;
      irqstate_t flags;
      bool active;

      (void)nxsem_tickwait_uninterruptible(&service->request_sem,
                                            MSEC2TICK(20));

#ifdef CONFIG_BK7258_VOICE_TLS
      bkvoice_runtime_step(__atomic_load_n(&service->endpoint_created,
                                           __ATOMIC_ACQUIRE));
#endif

#ifndef CONFIG_BK7258_VOICE_TLS
      if (bkvoice_turn_poll(&service->ptt.turn) < 0)
        {
          syslog(LOG_WARNING, "BKVOICE playback completion failed\n");
        }
#endif

      flags = spin_lock_irqsave(&service->request_lock);
      active = service->active;
      memcpy(&request, &service->active_request, sizeof(request));
      generation = service->active_generation;
      spin_unlock_irqrestore(&service->request_lock, flags);

      if (!active)
        {
          continue;
        }

      if (bkvoice_connection_valid(service, generation))
        {
          (void)bkvoice_handle_request(service, generation, &request,
                                        &response);
        }
      else
        {
          bkvoice_make_response(&response, &request, -ENOTCONN);
        }

      flags = spin_lock_irqsave(&service->request_lock);
      /* Secret upload chunks are retried by bounded offset/readback in the
       * uploader, never retained in the general RPC replay cache.
       */

      service->replay_valid =
        request.command != BKVOICE_RPC_CONFIG_DATA &&
        bkvoice_connection_valid(service, generation);
      if (service->replay_valid)
        {
          memcpy(&service->last_request, &request, sizeof(request));
          memcpy(&service->last_response, &response, sizeof(response));
        }

