open-vela/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_voice_service.c
      memset(&service->active_request, 0, sizeof(service->active_request));
      service->active = false;
      spin_unlock_irqrestore(&service->request_lock, flags);

      /* Never wait for a TX buffer.  A lost response is replayed when the
       * client retries the same session/sequence request.
       */

      if (bkvoice_connection_valid(service, generation))
        {
          (void)bkvoice_send(service, &response);
        }

      {
        volatile unsigned char *secret = (void *)&request;
        for (size_t i = 0; i < sizeof(request); i++)
          {
            secret[i] = 0;
          }
      }
    }

  return OK;
}

static bool bkvoice_request_valid(
  const struct bkvoice_rpc_request_s *request)
{
  bool manifest_terminated;
  bool clip_terminated;

  manifest_terminated = memchr(request->manifest, '\0',
                               sizeof(request->manifest)) != NULL;
  clip_terminated = memchr(request->clip_id, '\0',
                           sizeof(request->clip_id)) != NULL;
  if (!manifest_terminated || !clip_terminated || request->session == 0 ||
      request->sequence == 0)
    {
      return false;
    }

  if (request->command == BKVOICE_RPC_STATUS ||
      request->command == BKVOICE_RPC_PREFS_GET)
    {
      return request->manifest[0] == '\0' && request->clip_id[0] == '\0';
    }

#ifdef CONFIG_BK7258_VOICE_HIL_TEST
  if (request->command == BKVOICE_RPC_HIL_CAPTURE)
    {
      return request->manifest[0] != '\0' && request->clip_id[0] == '\0';
    }
#endif

  if (request->command == BKVOICE_RPC_CONFIG_BEGIN ||
      request->command == BKVOICE_RPC_PREFS_VOLUME ||
      request->command == BKVOICE_RPC_PREFS_PERSONA)
    {
      return request->manifest[0] != '\0' && request->clip_id[0] == '\0';
    }

  if (request->command == BKVOICE_RPC_CONFIG_DATA)
    {
      return request->manifest[0] != '\0' && request->clip_id[0] != '\0';
    }

  if (request->command >= BKVOICE_RPC_CONFIG_COMMIT &&
      request->command <= BKVOICE_RPC_DISCONNECT)
    {
      return request->manifest[0] == '\0' && request->clip_id[0] == '\0';
    }

  if (request->command == BKVOICE_RPC_VERIFY)
    {
      return request->manifest[0] != '\0' && request->clip_id[0] == '\0';
    }

  return request->command == BKVOICE_RPC_PLAY &&
         request->manifest[0] != '\0' && request->clip_id[0] != '\0';
}

static int bkvoice_service_cb(struct rpmsg_endpoint *endpoint, void *data,
                              size_t len, uint32_t src, void *priv)
{
  struct bkvoice_service_s *service = priv;
  const struct bkvoice_rpc_request_s *request = data;
  struct bkvoice_rpc_response_s response;
  irqstate_t flags;
  bool replay = false;
  bool duplicate = false;

  (void)endpoint;
  (void)src;

  if (request == NULL || len != sizeof(*request) ||
      request->magic != BKVOICE_RPC_MAGIC ||
      request->version != BKVOICE_RPC_VERSION)
    {
      return -EINVAL;
    }

  if (!bkvoice_request_valid(request))
    {
      bkvoice_make_response(&response, request, -EINVAL);
      return bkvoice_send(service, &response);
    }

  flags = spin_lock_irqsave(&service->request_lock);
  if (service->replay_valid &&
      request->session == service->last_request.session &&
      request->sequence == service->last_request.sequence)
    {
      if (memcmp(request, &service->last_request, sizeof(*request)) != 0)
        {
          spin_unlock_irqrestore(&service->request_lock, flags);
          bkvoice_make_response(&response, request, -EPROTO);
          return bkvoice_send(service, &response);
        }

      memcpy(&response, &service->last_response, sizeof(response));
      replay = true;
    }
  else if (service->active)
    {
      duplicate = memcmp(request, &service->active_request,
                         sizeof(*request)) == 0;
      spin_unlock_irqrestore(&service->request_lock, flags);
      if (duplicate)
        {
          return OK;
        }

      bkvoice_make_response(&response, request, -EBUSY);
      return bkvoice_send(service, &response);
    }
  else
    {
      memcpy(&service->active_request, request, sizeof(*request));
      service->active_generation = __atomic_load_n(
        &service->endpoint_generation, __ATOMIC_ACQUIRE);
      service->active = true;
    }

  spin_unlock_irqrestore(&service->request_lock, flags);
  if (replay)
    {
      return bkvoice_send(service, &response);
    }

  return nxsem_post(&service->request_sem);
}

static bool bkvoice_ns_match(struct rpmsg_device *rdev, void *priv,
                             const char *name, uint32_t dest)
{
  const char *cpuname = rpmsg_get_cpuname(rdev);

  (void)priv;
  (void)dest;
  return cpuname != NULL && strcmp(cpuname, "cp") == 0 &&
         strcmp(name, BKVOICE_RPC_ENDPOINT) == 0;
}

static void bkvoice_service_unbind(struct rpmsg_endpoint *endpoint)
{
  struct bkvoice_service_s *service = endpoint->priv;
  irqstate_t flags;

  if (service == NULL)
    {
      return;
    }

  __atomic_store_n(&service->endpoint_created, false, __ATOMIC_RELEASE);
  bkvoice_advance_generation(service);
  flags = spin_lock_irqsave(&service->request_lock);
  service->replay_valid = false;
  spin_unlock_irqrestore(&service->request_lock, flags);
  (void)nxsem_post(&service->request_sem);
}

static void bkvoice_ns_bind(struct rpmsg_device *rdev, void *priv,
                            const char *name, uint32_t dest)
{
  struct bkvoice_service_s *service = priv;
  int ret;

  ret = nxmutex_lock(&service->endpoint_lock);
  if (ret < 0)
    {
      return;
    }

  if (!__atomic_load_n(&service->endpoint_created, __ATOMIC_ACQUIRE))
    {
      service->endpoint.priv = service;
      if (service->endpoint.rdev != NULL)
        {
          rpmsg_destroy_ept(&service->endpoint);
        }

      ret = rpmsg_create_ept(&service->endpoint, rdev, name,
                             RPMSG_ADDR_ANY, dest,
                             bkvoice_service_cb, bkvoice_service_unbind);
      if (ret >= 0)
        {
          bkvoice_advance_generation(service);
          __atomic_store_n(&service->endpoint_created, true,
                           __ATOMIC_RELEASE);
        }
    }

  nxmutex_unlock(&service->endpoint_lock);
}

static void bkvoice_device_destroy(struct rpmsg_device *rdev, void *priv)
{
  struct bkvoice_service_s *service = priv;
  const char *cpuname = rpmsg_get_cpuname(rdev);

  if (cpuname == NULL || strcmp(cpuname, "cp") != 0)
    {
      return;
    }

  bkvoice_service_unbind(&service->endpoint);
  if (nxmutex_lock(&service->endpoint_lock) >= 0)
    {
      if (service->endpoint.rdev != NULL)
        {
          rpmsg_destroy_ept(&service->endpoint);
        }

      memset(&service->endpoint, 0, sizeof(service->endpoint));

      nxmutex_unlock(&service->endpoint_lock);
    }
}

int bk7258_voice_service_prepare(void)
{
  return OK;
}

int bk7258_voice_service_start(void)
{
  struct bkvoice_service_s *service = &g_bkvoice_service;
  const struct bkvoice_capture_source_ops_s *source_ops;
  const struct bkvoice_turn_audio_ops_s *audio_ops;
  const struct bkvoice_ptt_worker_config_s worker_config =
  {
    .stack_size = CONFIG_BK7258_VOICE_CAPTURE_STACKSIZE,
    .priority = CONFIG_BK7258_VOICE_CAPTURE_PRIORITY,
    .join_timeout_ms = CONFIG_BK7258_VOICE_CAPTURE_JOIN_TIMEOUT_MS,
  };
  const struct bkvoice_turn_limits_s turn_limits =
  {
    .capture_timeout_ms = CONFIG_BK7258_VOICE_CAPTURE_TIMEOUT_MS,
    .waiting_tts_timeout_ms = CONFIG_BK7258_VOICE_WAITING_TTS_TIMEOUT_MS,
    .playback_timeout_ms = CONFIG_BK7258_VOICE_PLAYBACK_TIMEOUT_MS,
    .audio_frame_bytes = BKVOICE_COMPANION_AUDIO_FRAME_BYTES,
  };
  uint32_t boot_generation;
  bool callback_registered = false;
  bool ptt_initialized = false;
  bool semaphore_initialized = false;
  pid_t pid;
  int ret;

  ret = nxmutex_lock(&service->init_lock);
  if (ret < 0)
    {
      return ret;
    }

