open-vela/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_voice_service.c
  if (__atomic_load_n(&service->initialized, __ATOMIC_ACQUIRE))
    {
      nxmutex_unlock(&service->init_lock);
      return OK;
    }

  bk7258_agent_media_player_link();
  bk7258_agent_media_recorder_link();
  ret = bkvoice_turn_audio_initialize(&service->turn_audio);
  if (ret >= 0)
    {
      audio_ops = bkvoice_turn_audio_ops();
      source_ops = bkvoice_turn_audio_capture_source_ops();
      boot_generation = __atomic_load_n(
        &bk7258_ap_boot_state()->generation, __ATOMIC_ACQUIRE);
      ret = audio_ops != NULL && source_ops != NULL ? 0 : -ENOSYS;
      if (ret >= 0 && boot_generation == 0)
        {
          ret = -EAGAIN;
        }

      if (ret >= 0)
        {
          ret = bkvoice_ptt_initialize(
            &service->ptt, audio_ops, &service->turn_audio,
            source_ops, &service->turn_audio, &turn_limits,
            &worker_config, boot_generation);
          ptt_initialized = ret >= 0;
        }

#ifdef CONFIG_BK7258_DISPLAY_SERVICE
      if (ret >= 0)
        {
          int feedback_ret = bk7258_voice_feedback_start();

          if (feedback_ret >= 0)
            {
              feedback_ret = bkvoice_turn_set_state_observer(
                &service->ptt.turn, bk7258_voice_feedback_report, NULL);
            }

          if (feedback_ret < 0)
            {
              syslog(LOG_WARNING,
                     "BKVOICE EYES start ret=%d best_effort=1\n",
                     feedback_ret);
            }
        }
#endif
    }

  if (ret >= 0)
    {
      ret = nxsem_init(&service->request_sem, 0, 0);
    }
  if (ret >= 0)
    {
      semaphore_initialized = true;
    }

#ifdef CONFIG_BK7258_VOICE_TLS
  if (ret >= 0)
    {
      ret = bkvoice_runtime_initialize(&service->ptt, boot_generation,
                                       &service->request_sem);
    }
#endif

#ifdef CONFIG_PRIORITY_INHERITANCE
  if (ret >= 0)
    {
      ret = nxsem_set_protocol(&service->request_sem, SEM_PRIO_NONE);
    }
#endif

  if (ret >= 0)
    {
      ret = rpmsg_register_callback(service, NULL,
                                    bkvoice_device_destroy,
                                    bkvoice_ns_match, bkvoice_ns_bind);
      callback_registered = ret >= 0;
    }

  if (ret >= 0)
    {
      pid = task_create("bkvoice-svc", CONFIG_BK7258_VOICE_SERVICE_PRIORITY,
                        CONFIG_BK7258_VOICE_SERVICE_STACKSIZE,
                        bkvoice_worker, NULL);
      if (pid < 0)
        {
          ret = bkvoice_errno();
        }
    }

  if (ret >= 0)
    {
      __atomic_store_n(&service->initialized, true, __ATOMIC_RELEASE);
      syslog(LOG_INFO,
             "BKVOICE SERVICE READY endpoint=%s persona=%s name=%s "
             "disclosure=%s ptt_owner=ready eyes=best-effort "
             "transport=%s\n",
             BKVOICE_RPC_ENDPOINT, BKVOICE_PRODUCT_PERSONA_ID,
             BKVOICE_PRODUCT_DISPLAY_NAME, BKVOICE_PRODUCT_DISCLOSURE,
             BKVOICE_TRANSPORT_STATUS);
    }
  else
    {
#ifdef CONFIG_BK7258_VOICE_TLS
      (void)bkvoice_runtime_uninitialize();
#endif
      if (callback_registered)
        {
          rpmsg_unregister_callback(service, NULL,
                                    bkvoice_device_destroy,
                                    bkvoice_ns_match, bkvoice_ns_bind);
        }

      if (nxmutex_lock(&service->endpoint_lock) >= 0)
        {
          __atomic_store_n(&service->endpoint_created, false,
                           __ATOMIC_RELEASE);
          bkvoice_advance_generation(service);
          if (service->endpoint.rdev != NULL)
            {
              rpmsg_destroy_ept(&service->endpoint);
            }

          memset(&service->endpoint, 0, sizeof(service->endpoint));
          nxmutex_unlock(&service->endpoint_lock);
        }

      if (semaphore_initialized)
        {
          (void)nxsem_destroy(&service->request_sem);
        }

      if (ptt_initialized)
        {
          (void)bkvoice_ptt_uninitialize(&service->ptt);
        }

      service->active = false;
      service->replay_valid = false;
    }

  nxmutex_unlock(&service->init_lock);
  return ret;
}

#endif /* CONFIG_BK7258_VOICE_SERVICE */
